

/*
console.log(5<3);
console.log(5>3);
let a = '5' ;
let b = 5 ;
console.log( a == b ); //так делать не стоит == не серогое сравнение
console.log('5' === 5 ); //а так правильно
*/
//-----------------------------------------------------------
/*
a = 56 ;
b = 56;

if(a < b){
    console.log('а меньше б и это хорошо');
}else if( a > b){
    console.log('а больше б и это не так как хочется');
}else{
    console.log('а равно б и это норм');
}
*/

//-------------------------------------------------------
/*
 35 === 78 ? console.log('условие верно') : console.log('условие не верно') ;


 let time = 11;
  let text_tim = time < 12 ? 'доброе утро' : 'добрый день' ;
console.log(text_tim);
*/
//--------------------------------------------------------
/*
let roma = 'я Рома, всем привет';
let hi = 'и вам тоже привет';

console.log('а теперь '+roma+' и даже вам '+hi+'');
console.log(`а теперь ${roma} и даже вам ${hi}`);

 */
//-------------------------------------------------------
/*
function seyHi(name){
   console.log(name);
   name === 'олег' ?  alert(name)  : console.log('не он');
}

seyHi('лесничий');
seyHi('пастернак');
seyHi('олег');
seyHi('король');
seyHi('засранец');

 */
//-----------------------------------------------------
/*
//--function declaration
roma(1);

function roma(s){
    console.log(`привет деклорейшин - ${s}`);
}

roma(2);

//--function ekspression

//  ошибка  в таком написании вызывать функцию можно только после ее объявления
//  roman(3);

const roman = function(s){
    console.log(`тамара експрессион - ${s}`);
}

roman(4);
*/



//----------------------------------------------

















